#include "stdio.h"

int main() {
    int i=5, j=36;
    float x=0.001, y=0.00, z=-81.753;
    char c='z', d='M';

    (y-x)>=z;

    return 0;
}

// y-=(c+d)/i+x >> -39.0009995
// z/j >> -2.2709167
// (x*j) >= (z*i) >> 1
// y=x=z-j >> j มีค่า 36, x มีค่า -117.752998, y มีค่า -117.752998, z มีค่า -81.7529984
// (y-x)>=z >> 1
// (d <= 'a') && ('A' >= c-30) >> 0
// j*=(int)(x+z)/2 >> j มีค่า -1440, x มีค่า 0.00100000005, z มีค่า -81.7529984
// j*(i-7)>(y-2) >> 0
// c=i+=j >> c มีค่า 41, i มีค่า 41, j มีค่า 36
// i=c%j >> c มีค่า 122, i มีค่า 14, j มีค่า 36
